tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "buo/cask-upgrade"

brew "alerter"
brew "ansible"
brew "cmake"
brew "direnv"
brew "github-keygen"
brew "gh"
brew "gnupg"
brew "jq"
brew "mas"
brew "nvm"
brew "postgresql"
brew "pyenv"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vim"
brew "zsh-completions"

cask "1password"
cask "actual"
cask "airtable"
cask "alfred"
cask "brave-browser"
cask "calibre"
cask "charles"
cask "chatterino"
cask "clay"
cask "daisydisk"
cask "dash"
cask "discord"
cask "dropbox"
cask "electron-fiddle"
cask "fantastical"
cask "google-chrome"
cask "google-cloud-sdk"
cask "hammerspoon"
cask "inkscape"
cask "iterm2"
cask "keycastr"
cask "kindle"
cask "krisp"
cask "little-snitch"
cask "loom"
cask "mmhmm"
cask "notion"
cask "obs"
cask "obsidian"
cask "raycast"
cask "screenflow"
cask "scrivener"
cask "signal"
cask "skim"
cask "slack"
cask "spotify"
cask "steam"
cask "superhuman"
cask "telegram"
cask "transmission"
cask "unpkg"
cask "visual-studio-code"
cask "vlc"
cask "vnc-viewer"
cask "whatsapp"
cask "zoom"
cask "zotero"

mas "XCode", id: 497799835
mas "Shush - Microphone Manager", id: 496437906
mas "Magnet", id: 441258766
